CREATE TABLE institutes (
    id SERIAL PRIMARY KEY,
    name VARCHAR(1024) NOT NULL
);
CREATE TABLE groups (
    id SERIAL PRIMARY KEY,
    name VARCHAR(2048) NOT NULL,
    short_name VARCHAR(64) NOT NULL UNIQUE,
    year INTEGER NOT NULL,
    institute_id INTEGER NOT NULL
);
CREATE TABLE students (
    id SERIAL PRIMARY KEY,
    surname VARCHAR(512) NOT NULL,
    name VARCHAR(512) NOT NULL,
    father_name VARCHAR(512),
    group_id INTEGER NOT NULL
);
INSERT INTO institutes (name) VALUES ('Институт математики и информатики');

INSERT INTO groups (name, short_name, year, institute_id) VALUES
('Информатика и вычислительная техника', 'Б-ИВТ-25-1', 2025, 1),
('Информатика и вычислительная техника', 'Б-ИВТ-25-2', 2025, 1),
('Фундаментальная информатика и информационные технологии', 'Б-ФИИТ-25', 2025, 1),
('Прикладная информатика', 'Б-ПИ-25-1', 2025, 1);

INSERT INTO students (surname, name, father_name, group_id) VALUES
('Пермяков', 'Оскар', 'Анатольевич', 2),
('Винокуров', 'Максим', 'Иванович', 2),
('Захарова', 'Сантейя', 'Никифоровна', 2),
('Камайло', 'Пейшенс', NULL, 2),
('Кангелдиев', 'Эрлан', 'Максимович', 2),
('Каратаев', 'Святослав', 'Альбертович', 2),
('Константинов', 'Вячеслав', 'Антонович', 2),
('Кырбасов', 'Мичил', 'Александович', 2),
('Михайлов', 'Василий', 'Игоревич', 2),
('Николаева', 'Дайаана', 'Васильевна', 2),
('Ноев', 'Альберт', 'Сидорович', 2),
('Павлов', 'Алексей', NULL, 2),
('Петров', 'Николай', 'Борисович', 2),
('Рубан', 'Тимур', 'Иванович', 2),
('Семёнов', 'Дьулуур', 'Ньургунович', 2),
('Сивцев', 'Эркин', 'Васильевич', 2),
('Старостин', 'Любомир', 'Емельянов', 2),
('Тимофеев', 'Никон', 'Павлович', 2),
('Сивцев', 'Эркин', 'Васильевич', 2),
('Старостин', 'Любомир', 'Емельянов', 2),
('Третьяков', 'Антон', 'Акакиевич', 2),
('Фролова', 'Ксения', 'Владимировна', 2),
('Чуллиев', 'Алланазар', NULL, 2),
('Эртюков', 'Владимир', 'Константинович', 2),
('Яковлев', 'Аян', 'Власьевич', 2),
('Наумов', 'Аял', NULL, 2);

SELECT * FROM institutes;
SELECT * FROM groups;
SELECT * FROM students;